Revit 2026 API

# ExternalResourceBrowserData Class

---

Represents a collection of external resources and external resource folders to be presented as the content of a folder in the file browser in Revit.

SystemObject Autodesk.Revit.DBExternalResourceBrowserData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalResourceBrowserData : IDisposable
```
```vb
Public Class ExternalResourceBrowserData
	Implements IDisposable
```
```cpp
public ref class ExternalResourceBrowserData : IDisposable
```
```fsharp
type ExternalResourceBrowserData =
    class
        interface IDisposable
    end
```

The ExternalResourceBrowserData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternalResourceBrowserData | Constructs a new ExternalResourceBrowserData using the given document(optional), server id, folder path and match options. |

|  | Name | Description |
| --- | --- | --- |
|  | FolderPath | The current folder path to which the new resources and subfolder belong. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ServerId | The Id of IExternalResourceServer which handles the external resource load. |

|  | Name | Description |
| --- | --- | --- |
|  | AddResource(String) | Adds an external resource to the folder path by supplying the resource name. |
|  | AddResource(String, IDictionaryString, String) |  |
|  | AddResource(String, String) | Adds an external resource to the folder path by supplying the resource name and version. |
|  | AddResource(String, String, IDictionaryString, String) |  |
|  | AddSubFolder(String) | Adds a subfolder to the folder path with the given name. |
|  | AddSubFolder(String, String) | Adds a subfolder to the folder path with the given name and icon type. |
|  | CallingDocumentHasModelPath | Indicates whether the document requesting the external resource browser data has a defined ModelPath. |
|  | Dispose | Releases all resources used by the ExternalResourceBrowserData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCallingDocumentModelPath | Returns a copy of the ModelPath of the document that is requesting the external resource browser data. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetMatchOptions | Gets the match options used to filter external resources. |
|  | GetResources | Gets the external resources under the folder path of the browser data. |
|  | GetSubFoldersData | Gets the subfolders data under the folder path of the browser data. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidFolderName | Checks whether the folder name is valid. |
|  | IsValidResourceName | Checks whether the resource name is valid. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This data represents the contents to be shown to the user while they are browsing a specific folder in Revit.

The folder path can be obtained from the FolderPath property.

The external resource server is expected to populate all of the available resources and subfolders that should appear in the Revit file browser while the browser is open to this particular folder.

If the user navigates to another folder, a different ExternalResourceBrowserData object will be provided to allow the server to populate resources at that location.

When adding resource and subfolder, the resource and subfolder should not be added recursively.

When adding resource and subfolder, the name should be unique short name(without folder).

The name of resource and subfolder should not contain any invalid character of \/:*?"<>|.

The length of resource combined path(server name + folder path + resource name) should not exceed 259; The length of subfolder also has same restriction.

#### Reference

Autodesk.Revit.DB Namespace